Revit 2024 API
HVACLoadBuildingType Class
 The type element of building.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class HVACLoadBuildingType : HVACLoadType
Visual Basic
Public Class HVACLoadBuildingType _
	Inherits HVACLoadType
Visual C++
public ref class HVACLoadBuildingType : public HVACLoadType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.HVACLoadType
 Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
See Also
HVACLoadBuildingType Members
Autodesk.Revit.DB.Analysis Namespace